
# Задание task_02_06.
'''
Даны вещественные числа a, b, c (a≠0).
Решите уравнение ax^2+bx+c=0. При выводе значений оставьте 1 знак после запятой.
'''
# Выполнил: Ставецкий Максим Иванович
# Группа: ЦИБ-251



a = float (input ('a = '))
b = float (input ('b = '))
c = float (input ('c = '))

# Расчет дискриминанта
d = b ** 2 - 4 * a * c

# Вывод решения в зависимости от значения дискриминанта
# При выводе значений оставьте 1 знак после запятой
if d > 0:
    x1 = (-b - d ** (1/2)) / (2 * a)
    x2 = (-b + d ** (1/2)) / (2 * a)
    print ('x1 = {:.1f}, x2 = {:.1f}'.format (x1, x2))
elif d == 0:
    x = -b / (2 * a)
    print ('x = {:.1f}'.format (x))
else:
    print ('Решений нет')

# --------------
# Пример вывода:
#
# a = 1
# b = 2
# c = 3
# Решений нет
#
# a = 1
# b = 2
# c = 1
# x = -1.0
#
# a = 1
# b = 3
# c = -4
# x1 = -4.0, x2 = 1.0
