
# Задание task_02_28.
'''
Составьте программу для нахождения всех натуральных решений
уравнения x^2+y^2+z^2=k^2, где x,y,z∈[1,30], а k вводится с клавиатуры.
'''
# Выполнил: Ставецкий Максим Иванович
# Группа: ЦИБ-251



k = int (input ('k = '))

for x in range (1, 30 + 1):
    for y in range (1, 30 + 1):
        for z in range (1, 30 + 1):
            if x ** 2 + y ** 2 + z ** 2 == k ** 2:
                print ('x = {:2d}, y = {:2d}, z = {:2d}'.format (x, y, z))

# --------------
# Пример вывода:
#
# k = 30
# x =  4, y = 10, z = 28
# x =  4, y = 20, z = 22
# x =  4, y = 22, z = 20
# x =  4, y = 28, z = 10
# x = 10, y =  4, z = 28
# x = 10, y = 20, z = 20
# x = 10, y = 28, z =  4
# x = 20, y =  4, z = 22
# x = 20, y = 10, z = 20
# x = 20, y = 20, z = 10
# x = 20, y = 22, z =  4
# x = 22, y =  4, z = 20
# x = 22, y = 20, z =  4
# x = 28, y =  4, z = 10
# x = 28, y = 10, z =  4
