# Задание task_01_06.
#
# Выполнил: Ставецкий Максим Иванович
# Группа: ЦИБ-251


a = int (input ('Введите a = '))
b = int (input ('Введите b = '))
m = int (input ('Введите m = '))
n = int (input ('Введите n = '))

x = -b / a

is_ok = (x >= m) and (x <= n)

print("Попадает:", is_ok)


# --------------
# Пример вывода:
#
# Введите a = 1
# Введите b = 2
# Введите m = -5
# Введите n = 5
# Попадает: True
